src/Reports/РасчетПоказателей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Report>
		<Properties>
			<Name>РасчетПоказателей</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Дата1</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дата2</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Периодичность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Периодичность</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтандартОтчетности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтандартыОтчетности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФлагИспользоватьВыделениеЦветом</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

src/Reports/РасчетПоказателей/Forms/ФормаОтчета/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	
	Отчет.Дата1 = Период.ДатаНачала;
	Отчет.Дата2 = Период.ДатаОкончания;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Отчет.Дата2 = КонецГода(ТекущаяДата());
	Отчет.Дата1 = НачалоГода(ДобавитьМесяц(Отчет.Дата2, -5*12));
	Период.ДатаНачала = Отчет.Дата1;
	Период.ДатаОкончания = Отчет.Дата2;
	
	Отчет.ФлагИспользоватьВыделениеЦветом = Истина;
	
КонецПроцедуры
